#დავალება 1 :

# ცვლადის i მნიშვნელობა იწყება 0-ით
i = 0

# while ლუპი ამოწმებს პირობას: i < 5
# თუ პირობა მართალია, კოდი ლუპის შიგნით შესრულდება
while i < 5:
    # ბეჭდავს i-ს მნიშვნელობას
    print(i)
    
    # ზრდის i-ს მნიშვნელობას 1-ით, რათა irgendwann პირობა გახდეს ცრუ
    i += 1

# როცა i გახდება 5, პირობა i < 5 აღარ იქნება მართალი
# ლუპი შეწყდება და პროგრამა გააგრძელებს მუშაობას ლუპის შემდეგ


# დავალება 2 :

# ვიწყებთ i-ს მნიშვნელობით 0


# სანამ i ნაკლებია ან ტოლია 10-ის, ციკლი იმუშავებს
while i <= 10:
    print(i)
    i += 1  # ყოველ ციკლში i-ს ვზრდით 1-ით

