# დავალება 1
# ალგორითმი არის ნაბიჯ ნაბიჯ ინსტრუქციები რომლებსაც სხვადასხვა რაიმეს შესასრულებლად ვიყენებთ .
# პროგრამიირებაში ალგორითმებ არის კომპიუტერული ინსტრუქციების ლოგიკური და ზუსტი თანმიმდევრობა,
#  რომელიც ეუბნება კომპიუტერს როგორ უნდა გადაჭრას კონკრეტული ამოცანა .

# დავალება 2
for number in range (2,201, 2 ) :
    print(number)


# დავალება 3

for number in range(1, 100, 2):
    print(number)


# დავალება 4
# მომხმარებლისგან მონაცემების მიღება
name=input("შეიყვანე შენი სახელი:")
surname=input("შეიყვანე შენი გვარი:")
repeat__count=int(input("შეიყვამნე რენდომ რიცხვი:"))

# for ციკლის მეშვეობით დაბეჭდვა
for i in range(repeat__count):
    print(name, surname)

# დავალება 5

# მომხმარებლისგან მონაცემების მიღება
name = input("შეიყვანე შენი სახელი: ")
age = int(input("შეიყვანე შენი ასაკი: "))

# for ციკლის მეშვეობით სახელის დაბეჭდვა ასაკის რაოდენობით
for i in range(age):
    print(name)








