# 3. დეკლარაცია, ინიციალიზაცია და რეინიციალიზება
 # დეკლარაცია — როდესაც ადასტურებ, რომ გინდა შექმნა ცვლადი და ვაჩენ მას სახელით, მაგრამ მნიშვნელობა ჯერ არა აქვს.
 # იუმინალიზაცია — როდესაც ცვლადს ვანიჭებ მნიშვნელობას პირველად.
# რეინიციალიზება — როდესაც ცვლადს ვანიჭებ ახალი მნიშვნელობას, რომელიც სხვაა პირვანდელი.

# მაგალითები :


# დეკლარაცია 
total_score = None 

# ინიციალიზაცია (პირველად ვანიჭებთ მნიშვნელობას)
total_score = 85

# რეინიციალიზება (მეორედ, ვანიჭებთ ახალ მნიშვნელობას)
total_score=92

)