#6)მომხმარებელს ჰკითხეთ თუ რა ქულა მიიღო ტესტში,
#  თქვენი მიზანია დაადგინოთ ქულის მიხედვით რა შეგფასებას მიიღებს მომხმარებელი => 90-100 - "A-ფრიადი" ,
#  70-89 - "B-კარგი" , "50-69 - "C-დამაკმაყოფილებელი" , 0-49 - "ჩაიჭრა"


score = int(input("შეიყვანე ტესტის ქულა (0-100): "))

if 90 <= score <= 100:
    print("A - ფრიადი")
elif 70 <= score <= 89:
    print("B - კარგი")
elif 50 <= score <= 69:
    print("C - დამაკმაყოფილებელი")
elif 0 <= score <= 49:
    print("ჩაიჭრა")
else:
    print("არასწორი ქულა! გთხოვ შეიყვანე 0-დან 100-მდე.")    